[
  {
    "name": "Lenovo 15.6\" FHD Laptop Computers for Home Student Study",
    "price": 449.99,
    "description": "Processor: Intel Celeron N4500 (2C / 2T, 1.1 / 2.8GHz, 4MB)Graphics: Integrated Intel UHD GraphicsChipset: Intel SoC PlatformMemory: 32GB DDR4 RAMStorage: 1TB PCIe SSDCard Reader: SD Card ReaderOptical: NoneAudio Chip: High Definition (HD) AudioSpeakers: Stereo speakers, 1.5W x2, Dolby AudioCamera: HD 720p with Privacy ShutterMicrophone: 2x, ArrayBattery: Integrated 42WhPower Adapter: 45W Round Tip (3-pin)Display: 15.6\" FHD (1920x1080) Anti-glareKeyboard: Non-backlit, EnglishCase Color: Cloud GreyDimensions (WxDxH): 360.2 x 236 x 17.9 mm (14.18 x 9.29 x 0.70 inches)Weight: Around 1.55 kg (3.42 lbs)Operating System: Windows 11 Professional, EnglishWLAN + Bluetooth: Wi-Fi 6, 11ax 2x2 + BT5.2Standard Ports: 1x USB 2.0 1x USB 3.2 Gen 1 1x USB Type-C 3.2 Gen 1 (support data transfer only) 1x HDMI 1.4b 1x Card reader 1x Headphone / microphone combo jack (3.5mm) 1x Power connectorSecurity Chip: Firmware TPM 2.0Other Security: Camera privacy shutter",
    "stock": 41,
    "image_url": "https://m.media-amazon.com/images/I/71vdSXbETlL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Apple 2025 MacBook Air 15-inch Laptop with M4 chip: Built for Apple Intelligence",
    "price": 1078.38,
    "description": "Apple 2025 MacBook Air 15-inch Laptop with M4 chip: Built for Apple Intelligence, 15.3-inch Liquid Retina Display, 16GB Unified Memory, 256GB SSD Storage, 12MP Center Stage Camera, Touch ID; Sky Blue",
    "stock": 69,
    "image_url": "https://m.media-amazon.com/images/I/71FsB1FaZ7L._AC_SX342_SY445_QL70_FMwebp_.jpg"
  },
  {
    "name": "Apple 2024 MacBook Pro Laptop with M4 chip with 10‑core CPU and 10‑core GPU: Built for Apple Intelligence",
    "price": 1349,
    "description": "Apple 2024 MacBook Pro Laptop with M4 chip with 10‑core CPU and 10‑core GPU: Built for Apple Intelligence, 14.2-inch Liquid Retina XDR Display, 16GB Unified Memory, 512GB SSD Storage; Space Black",
    "stock": 69,
    "image_url": "https://m.media-amazon.com/images/I/61-oTP1X4rL._AC_SX342_SY445_QL70_FMwebp_.jpg"
  },
  {
    "name": "Apple 2025 MacBook Air 13-inch Laptop with M4 chip: Built for Apple Intelligence",
    "price": 849.99,
    "description": "Apple 2025 MacBook Air 13-inch Laptop with M4 chip: Built for Apple Intelligence, 13.6-inch Liquid Retina Display, 16GB Unified Memory, 256GB SSD Storage, 12MP Center Stage Camera, Touch ID; Midnight",
    "stock": 76,
    "image_url": "https://m.media-amazon.com/images/I/71cWZUr9SVL._AC_SX342_SY445_QL70_FMwebp_.jpg"
  },
  {
    "name": "Microsoft Surface Laptop (2024)",
    "price": 1472.15,
    "description": "* Some Copilot+ PCs require download of free updates to run Copilot+ PC experiences, available starting late 2024 – 2025. See aka.ms/copilotpluspcs ** Pre-release screen shown; subject to change. *** Availability of Copilot+ PC features varies by device and market. [1] Based on Cinebench 2024 Multi-threaded conducted by Microsoft in April 2024 comparing pre-release build of Surface Laptop 13.8\" and 15” with Snapdragon X Elite running pre-release Windows 11 26100 and Apple MacBook Air 13.6\" and 15” with M3 running macOS 14 Sonoma. [2] Optimized for select languages (English, Chinese (simplified), French, German, Japanese, and Spanish. Content-based and storage limitations apply. Recall is coming soon through a post-launch Windows Update. See https://aka.ms/copilotpluspcs. [3] Colors available on selected models only. Available colors, sizes, finishes, and processors may vary by store, market, and configuration. [4] Surface Laptop, excluding power supply, contains a minimum of 25% recycled content. Based on validation performed by Underwriter Laboratories, Inc. using Environmental Claim Validation Procedure for Recycled Content, UL 2809-2, Second Edition, November 7, 2023.  [5] Currently supports translation for video and audio subtitles into English from 40+ languages. See https://aka.ms/copilotpluspcs. [6] Battery life varies significantly based on device configuration, usage, network and feature configuration, signal strength, settings and other factors. See aka.ms/SurfaceBatteryPerformance for details. [7] 13.8\" Surface Laptop comes with 39 W Surface power supply. Fast charging (from 5% to 80%) is supported with minimum 65W Surface power supply or USB-C® PD charger, sold separately. Testing was conducted at Microsoft in February 2024, using pre-production devices, software, and minimum of 65W USB-C® charger under controlled conditions. The device was powered on to the desktop screen with default display brightness settings. Actual charge time will vary based on operating conditions. Measured at typical office ambient temperature of 23C.   [8] Enclosure includes A Cover, C Bucket and D Cover. 100% recycled aluminum alloy in A Cover and C Bucket. 100% recycled rare earth metals in magnets. Based on validation performed by Underwriter Laboratories, Inc. using Environmental Claim Validation Procedure (ECVP) for Recycled Content, UL 2809-2, Second Edition, November 7, 2023.  [9] Enclosure includes A Cover, C Bucket and D Cover. Based on validation performed by Underwriter Laboratories, Inc. using Environmental Claim Validation Procedure for Recycled Content, UL 2809-2, Second Edition, November 7, 2023. [10] Available colors may vary by market. [11] USB-C® port does not charge your Surface device or any device that requires more than 15W [12] Requires device with USB-C® USB4®/Thunderbolt™ 4 port and when supported by device and display. *Screens simulated; subject to change *Recall: Optimized for select languages (English, Chinese (simplified), French, German, Japanese, and Spanish.) Content-based and storage limitations apply. See [https://aka.ms/copilotpluspcs]. *Cocreator: Optimized for English text prompts See [https://aka.ms/copilotpluspcs]",
    "stock": 51,
    "image_url": "https://m.media-amazon.com/images/I/51gEuoeUX0L._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "HP Chromebook 14 Laptop",
    "price": 167.77,
    "description": "Whether you need a laptop for work, college, or everyday computing, the HP Chromebook 14 Laptop has got you covered. Watch movies or view spreadsheets in high-quality HD and in direct sunlight with a 14-inch anti-glare, micro-edge screen (1). Plus, with custom-tuned dual speakers, you’ll enjoy clear authentic audio to elevate all of your entertainment needs. Not only is this Chromebook outfitted for relaxing, but it’s also a productivity powerhouse. The HP laptop computer’s portable and lightweight design lets you take it just about anywhere, while the Intel® Celeron N4120 processor touts plenty of power for even your busiest days (2). Enjoy the highest resolution games and movies with the 4K-ready Intel UHD Graphics 600 (3) (4). Multitask faster, even with multiple windows open, and safely store more content with this HP 14-inch laptop’s 4 GB of RAM and 64 GB of eMMC storage (5).Pull all-nighters or binge-watch your favorite show with confidence thanks to your HP notebook computer’s 14 hours of battery life (6). When you do run short on power, just plug in your Chromebook charger and HP Fast Charge takes your battery to 50% in just 45 minutes (7). Not only does the Chrome OS give you greater security and an always up-to-date experience, but you can also take advantage of millions of apps in the Google Play Store (8). Work confidently with a 1-year limited hardware warranty and stay connected with the dependable 802.11a/b/g/n/ac (2x2) Wi-Fi and Bluetooth combo (9) (10). Expand the way you game, work, and create with the innovative HP Imagepad, a true multi-touch touchpad that supports four-finger gestures. Your HP 4K laptop isn’t just built for greater productivity and more immersive entertainment, but also for sustainability. Do your part toward a cleaner planet with an ENERGY STAR certified (11) and EPEAT Silver registered (12) Chromebook 14-inch.",
    "stock": 48,
    "image_url": "https://m.media-amazon.com/images/I/71tXLOE7wIL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "HP 15.6 inch Laptop",
    "price": 349.99,
    "description": "The HP 15.6 inch Laptop is designed to have your back with a reliable AMD processor and integrated Radeon graphics for assembling creative work projects or wowing your friends with HD resolution entertainment on the anti-glare touch display. Collaborate on group projects with a high quality camera, noise reduction software, and easy access to helpful AI technology. Long-lasting battery life and HP Fast Charge help you stay in the productive zone longer. Whether in your comfy spot at home or on-the-go, this HP 15.6 Laptop gives you a great view of your content and offers plenty of ports for connecting your additional devices. The HP 15.6 Laptop comes with a 45 W AC power adapter and goes from 0 to 50% charge in 45 minutes. Plus, it contains recycled materials and is EPEAT Gold registered and ENERGY STAR Certified. HP is here to help. This HP computer comes with 1-year limited hardware warranty and 90-days limited technical support for software and initial setup with 24-hour, 7 days a week web support when shipped from and sold by Amazon.com.",
    "stock": 1,
    "image_url": "https://m.media-amazon.com/images/I/71XTCkgshfL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "ASUS ROG Strix G16 (2025) Gaming Laptop",
    "price": 1399.98,
    "description": "Designed for serious gamers, the ROG Strix G16 features a 165Hz/3ms display, ensuring stunning visuals and fluid motion. Powered by an Intel® Core™ i7 Processor 14650HX and NVIDIA® GeForce RTX™ 5060 GPU, enjoy smooth gameplay and performance. With 16GB DDR5 memory, a 1TB PCIe 4.0 SSD, and advanced ROG Intelligent Cooling, be ready to push the limits. The esports-ready keyboard, Dolby Atmos audio, and customizable RGB Aura Light Bar elevate every gaming session. Plus, enjoy tool-free access to RAM and SSD, with 3 months of PC Game Pass for the ultimate gaming experience.",
    "stock": 73,
    "image_url": "https://m.media-amazon.com/images/I/81n1T4CYfmL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Dell Inspiron 3530 Laptop - 15.6-inch FHD (1920x1080) Display",
    "price": 299,
    "description": "A simple way to take on your day. The Inspiron 15 laptop is as stylish on the outside as it is efficient on the inside. Built with up to 13th Gen Intel processors, you can finish your to-do list in no time. Your Inspiron PC is now ready for business with military-grade testing for added reliability and an easy-to-use, built-in Trusted Platform Module to protect your data. Connect all your personal and business devices with a range of options. Enjoy quality video chats with a built-in FHD webcam that keeps you looking your best. Easily spend more screen time on the things you enjoy with Dell ComfortView software, which is software solution that helps reduce harmful blue light emissions to keep your eyes comfortable over extended viewing times, like your next movie marathon. Adaptive thermals keep your PC running efficiently, whether at your desk or working from your lap. Your Inspiron 15 notebook intelligently adjusts its power and thermals to keep running smoothly, using advanced algorithms and accelerometers.",
    "stock": 77,
    "image_url": "https://m.media-amazon.com/images/I/71iIEPk5qOL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "HP 14 inch Laptop",
    "price": 289.88,
    "description": "The HP 14\" Laptop helps you take on your day with real power. The reliable processing power of an Intel Core processor and long-lasting battery life help you stay in the zone longer, whether it's maximizing your workflow or creating personal projects. Get lost in a remarkable entertainment experience as the high definition display delivers boosted definition and crisp quality. Chat with ease with a high quality camera with a privacy shutter you can close when not in use, keeping you safe online. Get every point across with dual array digital microphones and advanced noise reduction software. The HP 14 Laptop comes with a 45 W AC power adapter and goes from 0 to 50% charge in 45 minutes. Plus, it contains recycled materials and is EPEAT Gold registered and ENERGY STAR Certified. HP is here to help. This HP computer comes with 1-year limited hardware warranty and 90-days limited technical support for software and initial setup with 24-hour, 7 days a week web support when shipped from and sold by Amazon.com.",
    "stock": 22,
    "image_url": "https://m.media-amazon.com/images/I/71l3HIXKZqL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "OnePlus 13",
    "price": 849.99,
    "description": "The OnePlus 13 is powered by the groundbreaking Snapdragon 8 Elite, with up to 16GB of RAM, delivering lightning-fast speeds and seamless performance. Enjoy a smooth, immersive experience on the 120Hz Super Fluid AMOLED display with Dynamic Refresh Rate. Capture stunning photos and videos with the 5th Generation Hasselblad Camera System. 50W AIRVOOC wireless charging ensures you stay powered up with North America's fastest charging speed. Powered by OxygenOS 15, enjoy a smarter, more intuitive smartphone experience.",
    "stock": 52,
    "image_url": "https://m.media-amazon.com/images/I/81YvgN0CcdL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Nokia G10 | Android 13 | Unlocked GSM Smartphone | 3-Day Battery | 3GB RAM | 64GB Storage | 6.52-Inch Screen | 13MP Triple Camera | Dusk | Not Compatible with Verizon or AT&T",
    "price": 69.99,
    "description": "To make the most of family life, you need plenty of energy. Luckily for you, Nokia G10 has a battery that goes days between charges – for more time to captivate your kids on the bigger screen. And with a triple rear camera, complete with enhanced imagery, you’re always ready to catch those special moments. Plus, when you reach the end of the day, there’s still plenty of power for you to unwind – why not call a friend, or catch up on your favorite show?",
    "stock": 4,
    "image_url": "https://m.media-amazon.com/images/I/81Io90tyv1L._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "SAMSUNG Galaxy A16 4G LTE (128GB + 4GB) International Model SM-A165F/DS Factory Unlocked 6.7\" Dual Sim 50MP Dual Cam (Case Bundle) (Light Green)",
    "price": 129.99,
    "description": "The Samsung Galaxy A16 offers a solid mix of features tailored for budget-conscious users while maintaining the quality expected of the Galaxy A series. It boasts a vibrant 6.7-inch Super AMOLED display with a smooth 90Hz refresh rate and a resolution of 1080x2340, delivering excellent clarity and color reproduction. The device is available with the Mideatek Helio G99, with a focus on providing stable everyday performance. With a 50MP main camera, a 5MP ultra-wide lens, and a 2MP macro sensor, the phone ensures decent photography capabilities. A 13MP front-facing camera complements the setup for selfies and video calls. It runs on Android 14 with Samsung’s One UI 6.1, supported by six promised major software updates, ensuring long-term usability. While its 5,000mAh battery supports 25W wired charging, the lack of a charger in the box may require an additional purchase. Expandable storage via microSD is a welcome addition, though the base 4GB RAM might limit multitasking in the future.",
    "stock": 44,
    "image_url": "https://m.media-amazon.com/images/I/61cmlEY2jsL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Samsung Galaxy A16 5G A Series",
    "price": 199.99,
    "description": "Discover an awesome experience at an awesome value with Galaxy A16 5G⁸. Packed with the essential features you need, A16 5G brings incredible value to everyday life.¹Measured diagonally, the screen size is 6.7\" in the full rectangle and 6.5\" accounting for the rounded corners. Actual viewable area is less due to the rounded corners and the camera cutout. ²IP54 rating for water and dust resistance. Water resistance based on laboratory test conditions for exposure to splashes of fresh water. Not advised for beach or pool use. Dust resistance based on laboratory test conditions, with limited protection against dust ingress. ³The heart rate software functions are not intended for medical use. ⁴Requires a compatible phone and NFC card from participating bank. See Samsung Wallet FAQ for more information.⁵Digital ID only for select corporate, government and educational institution partners. Mobile Driver's License only for TSA ID purposes, only for ID holders from select states and at select TSA checkpoints. Mobile Driver’s License for TSA ID only and does not replace physical license. ⁶25W Super Fast Charger sold separately. Super Fast Charging speed depends on battery level and other factors; use only Samsung-approved chargers and cables; do not use any worn or damaged chargers or cables; incompatible charger or cable can cause serious injuries or damage to your device. ⁷MicroSD card sold separately. Portion of memory occupied by existing content. ⁸Requires optimal 5G network connection, available in select markets. Check with your carrier for availability and details. Download and streaming speeds may vary based on content provider, server connection and other factors.",
    "stock": 70,
    "image_url": "https://m.media-amazon.com/images/I/71KGkQ+KOKL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Google Pixel 5 - 5G Android Phone - Water Resistant - Unlocked Smartphone with Night Sight and Ultrawide Lens - Just Black",
    "price": 284.44,
    "description": "\"Meet Pixel 5, the ultimate Google phone with the speed of 5G.[2] It has the helpful stuff you need in a phone, with an extra boost of 5G speed. So you can download a movie in seconds,[3] take stunning ultrawide photos in any light, and keep going with an all-day battery that can last up to 48 hours with Extreme Battery Saver.[8] Pixel 5 also charges wirelessly,[6] keeps your data safe, blocks robocalls,[11] and is water-resistant.[10] It’s the super helpful 5G Google cell phone at a helpful price. And it’s an unlocked smartphone, so you can choose the data plan and carrier that work for you.[1]   [1] Works with all major carriers. Contact carrier for details. 5G service is carrier dependent.  [2] Requires a 5G data plan (sold separately). 5G service and roaming not available on all carrier networks or in all areas. Contact carrier for details about current 5G network performance, compatibility, and availability. Phone connects to 5G networks, but 5G service, speed, and performance depend on many factors including, but not limited to, carrier network capabilities, device configuration and capabilities, network traffic, location, signal strength, and signal obstruction. Actual results may vary. Some features not available in all areas. Data rates may apply.  [3] Download speed claims based on testing videos from three streaming platforms. Average download time was less than sixty seconds. File sizes varied between 449MB and 1.3GB. Download speed depends upon many factors, such as file size, content provider and network connection. Testing conducted in an internal 5G network lab and on pre-production hardware in California in July/August 2020. Actual download speeds may be slower. [4] Enabling gameplay with cellular data may increase your mobile data usage up to 2.7GB/hr. Gameplay is service-, network-, connection-, and game-dependent, and may not be available for all games in all areas. Users may experience inconsistent gameplay. Stadia requires account creation. [5] Hotspot capability subject to carrier plan.  [6] Qi-compatible. Wireless charger sold separately. [7] Designed to charge Qi-certified devices. Use of Battery Share significantly reduces Pixel battery life. Cases may interfere with charging and will reduce charging speed. Charge speeds may vary. [8] For “All day”: Maximum battery life based on testing using a mix of talk, data, standby, and use of other features. Testing conducted on two major carrier networks using Sub-6 GHz non-standalone 5G (ENDC) connectivity. For “Up to 48 hours”: Maximum battery life based on testing using a mix of talk, data, standby, and use of limited other features that are default in Extreme Battery Saver mode (which disables various features including 5G connectivity). Testing conducted on two major carrier networks. For both claims: Pixel 4a (5G) and Pixel 5 battery testing conducted by a third party in California in mid 2020 on pre-production hardware and software using default settings, except that, for the “up to 48 hour claim” only, Extreme Battery Saver mode was enabled. Battery life depends upon many factors and usage of certain features will decrease battery life. Actual battery life may be lower. [9] Android version updates for at least 3 years from when the device first became available on the Google Store in the US.  [10] Pixel 5 has a dust and water protection rating of IP68 under IEC standard 60529. Charger and accessories are not water or dust resistant. Water and dust resistance are not permanent conditions and may be compromised due to normal wear and tear, repair, disassembly or damage.  [11] US only. English only. Call Screen may not detect all spam calls. [12] Screen sharing not available on group calls. Requires Wi-Fi or 5G internet connection. Not available on all apps and content. Data rates may apply. 5G service, speed and performance depend on many factors including, but not limited to, carrier network capabilities, device configuration and capabilities, network traffic, location, signal strength, and signal obstruction. [13] Some third-party apps and data may not be transferred automatically.  [14] Subscriptions may be required. [15] Not available for all apps and content. Display automatically adjusts to optimize for best viewing and battery performance.  [16] Storage specifications refer to capacity before formatting. Actual formatted capacity will be less.  [17] Maximum battery life based on testing using a mix of talk, data, standby, and use of other features. Battery life depends upon many factors and usage of certain features will decrease battery life. Pixel 4a (5G) and Pixel 5 battery testing conducted by a third party in California in mid 2020 on pre-production hardware and software, using default settings. Testing conducted on two major carrier networks using Sub-6 GHz non-standalone 5G (ENDC) connectivity. Actual battery life may be lower. [18] Qualcomm Snapdragon is a product of Qualcomm Technologies, Inc. and/or its subsidiaries. Qualcomm and Snapdragon are trademarks of Qualcomm Incorporated, registered in the United States and other countries. [19] Back housing only. [20] Up to 18W wired charging rates are based upon use of the included charger plugged into a wall outlet. Actual results may be slower. [21] Charging rates are based upon use of the included charger plugged into a wall outlet. Actual results may vary.\"",
    "stock": 12,
    "image_url": "https://m.media-amazon.com/images/I/81-fNmQqlLL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Samsung Galaxy A16 5G A Series",
    "price": 199.99,
    "description": "Discover an awesome experience at an awesome value with Galaxy A16 5G⁸. Packed with the essential features you need, A16 5G brings incredible value to everyday life.¹Measured diagonally, the screen size is 6.7\" in the full rectangle and 6.5\" accounting for the rounded corners. Actual viewable area is less due to the rounded corners and the camera cutout. ²IP54 rating for water and dust resistance. Water resistance based on laboratory test conditions for exposure to splashes of fresh water. Not advised for beach or pool use. Dust resistance based on laboratory test conditions, with limited protection against dust ingress. ³The heart rate software functions are not intended for medical use. ⁴Requires a compatible phone and NFC card from participating bank. See Samsung Wallet FAQ for more information.⁵Digital ID only for select corporate, government and educational institution partners. Mobile Driver's License only for TSA ID purposes, only for ID holders from select states and at select TSA checkpoints. Mobile Driver’s License for TSA ID only and does not replace physical license. ⁶25W Super Fast Charger sold separately. Super Fast Charging speed depends on battery level and other factors; use only Samsung-approved chargers and cables; do not use any worn or damaged chargers or cables; incompatible charger or cable can cause serious injuries or damage to your device. ⁷MicroSD card sold separately. Portion of memory occupied by existing content. ⁸Requires optimal 5G network connection, available in select markets. Check with your carrier for availability and details. Download and streaming speeds may vary based on content provider, server connection and other factors.",
    "stock": 5,
    "image_url": "https://m.media-amazon.com/images/I/71VV0kyOKCL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Motorola Moto G Play | 2024 | Unlocked | Made for US 4/64GB | 50MP Camera | Sapphire Blue",
    "price": 109.99,
    "description": "Give your favorite entertainment a big boost with the new moto g play - 2024. Featuring a Qualcomm® Snapdragon® 680 4G processor and 4GB**** of RAM, you have all the speed you need. Bring movies, games, and music to life on a fast-refreshing 6.5\" 90Hz* HD+ display along with stereo speakers and Dolby Atmos®. Capture sharp photos day or night with a fast-focusing 50MP*** camera and Quad Pixel technology. Enjoy 64GB**** of built-in storage for photos, movies, songs, and apps. And keep the fun going nonstop with a long-lasting 5000mAh***** battery. Sleek and stylish, it’s the premium design you’ve been craving. Great things are here with moto g play - 2024.",
    "stock": 25,
    "image_url": "https://m.media-amazon.com/images/I/61xk4XNRktL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Motorola Moto G Stylus 5G | 2024 | Unlocked | Made for US 8/256GB | 50MP Camera | Caramel Latte",
    "price": 199.99,
    "description": "Introducing moto g stylus 5G - 2024, with a new stylus that takes expression to another level. Jot notes, edit photos, sketch artwork, and navigate effortlessly with even faster responsiveness. Experience cinema-quality entertainment on the 6.7\" pOLED display backed by Dolby Atmos® sound. Capture sharper photos and smoother videos with the 50MP Ultra Pixel camera system featuring OIS. And have plenty of power when inspiration strikes thanks to a 5000mAh battery and ultra-fast TurboPower™ charging. Wherever you go, you’ll make a statement with a standout design featuring vegan leather. And with tons of storage, you’ll have room for all your favorite content and creations. Express yourself like never before with moto g stylus 5G.",
    "stock": 30,
    "image_url": "https://m.media-amazon.com/images/I/61LE9-6KxdL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Motorola Moto G 5G | 2024 | Unlocked | Made for US 4/128GB | 50MP Camera | Sage Green",
    "price": 129.99,
    "description": "With an immersive display and multidimensional sound, moto g 5G - 2024 takes your movies, shows, and games to the next level. Enjoy smooth gaming and seamless scrolling with a fast, fluid 6.6\" 120Hz display. Hear every detail with the unbelievable clarity of Dolby Atmos on stereo speakers. Capture sharper low-light photos with a 50MP Quad Pixel camera system. And unleash it all with 5G speeds powered by a Snapdragon octa-core processor. Plus, with a massive battery and TurboPower charging, the fun never stops. You can even experience a little luxury with the vegan leather design. Upgrade your entertainment with moto g 5G - 2024.",
    "stock": 17,
    "image_url": "https://m.media-amazon.com/images/I/61TTdTnaEeL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Samsung Galaxy A50 A505U 64GB GSM Unlocked Smartphone - Black (Renewed)",
    "price": 95,
    "description": "When you have a million things to do, charging won’t be one of them. Whether it’s a busy day or a big event, the Galaxy A50 all-day battery lasts up to 35 hours and if you need a boost, get up and running quickly with Fast Charge. 64GB of built-in memory means there's room for all your stuff, from contacts to apps and up to 100,000 photos. Even expand your memory up to 512GB with a microSD card. Get the perfect shot every time with the Ultra Wide Camera and three specialized lenses that let you capture wider photos, shoot in low-light and take share-worthy selfies. Now you can be sure to get the shareworthy photo every time. Flaw Detection intuitively detects when the photo you just took is blurry or if someone’s eyes were closed and then lets you know so you can reshoot while the moment's still right. With a camera that automatically adjusts in low light, your images turn out sharp day or night. Whether you’re at a late-night concert or spending an afternoon at the park, you can capture the moments as you remember them.Featuring a sleek, 6.4\" Super AMOLED edge-to-edge screen, the slimly designed Galaxy A50 fits easily into your pocket. Unlock your Galaxy A50 with a simple touch and the in-display fingerprint scanner will recognize you with just one finger.",
    "stock": 33,
    "image_url": "https://m.media-amazon.com/images/I/71N3nJoPQ+L._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Auto Face Tracking Tripod 360° Rotating iPhone Photo and Video Kits Stand",
    "price": 49.99,
    "description": "Auto Face Tracking Tripod 360° Rotating iPhone Photo and Video Kits Stand, No App, 2-Axis Foldable Magnetic Phone Holder, Smart Shooting Stand for Facetime, Recording & Live Streaming Tiktok YouTube",
    "stock": 29,
    "image_url": "https://m.media-amazon.com/images/I/71bkyDel5hL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Samsung Galaxy S21 5G",
    "price": 156.44,
    "description": "This pre-owned or refurbished product has been professionally inspected and tested to work and look like new. How a product becomes part of Amazon Renewed, your destination for pre-owned, refurbished products: A customer buys a new product and returns it or trades it in for a newer or different model. That product is inspected and tested to work and look like new by Amazon-qualified suppliers. Then, the product is sold as an Amazon Renewed product on Amazon. If not satisfied with the purchase, renewed products are eligible for replacement or refund under the Amazon Renewed Guarantee.",
    "stock": 30,
    "image_url": "https://m.media-amazon.com/images/I/61XyNdmvr6L._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Motorola Moto G Stylus 5G | 2024 | Unlocked | Made for US 8/256GB | 50MP Camera | Scarlet Wave",
    "price": 199.99,
    "description": "Introducing moto g stylus 5G - 2024, with a new stylus that takes expression to another level. Jot notes, edit photos, sketch artwork, and navigate effortlessly with even faster responsiveness. Experience cinema-quality entertainment on the 6.7\" pOLED display backed by Dolby Atmos® sound. Capture sharper photos and smoother videos with the 50MP Ultra Pixel camera system featuring OIS. And have plenty of power when inspiration strikes thanks to a 5000mAh battery and ultra-fast TurboPower™ charging. Wherever you go, you’ll make a statement with a standout design featuring vegan leather. And with tons of storage, you’ll have room for all your favorite content and creations. Express yourself like never before with moto g stylus 5G.",
    "stock": 35,
    "image_url": "https://m.media-amazon.com/images/I/61WBN0TuM+L._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Motorola Edge | 2024 | Unlocked | Made for US 8/256GB | 50MP Camera | Midnight Blue",
    "price": 249.99,
    "description": "With our most advanced low-light features on the 50MP camera, it’s easy to capture sharp and bright photos at night. Get power for the day by charging 50% of your battery in just 15 minutes.¹ Enjoy a beautifully curved design featuring vegan leather. Access anything with one touch of the Quick Button—plus get 256GB of storage3, Snapdragon® performance, and a cinematic pOLED display. Day or night, motorola edge is just right.",
    "stock": 25,
    "image_url": "https://m.media-amazon.com/images/I/61xrE9hme2L._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Google Pixel 10 Pro - Unlocked Android Smartphone - Gemini AI Assistant",
    "price": 1219,
    "description": "Pixel 10 Pro XL is the ultimate Pixel experience, featuring unprecedented AI - Gemini, unbelievable camera quality, impeccable design, and the next-gen Google Tensor G5 chip.[1]",
    "stock": 91,
    "image_url": "https://m.media-amazon.com/images/I/61OyKi98IuL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "DOOGEE Note 58 Android 16 Unlocked Phones",
    "price": 119.98,
    "description": "DOOGEE Note 58 Android 16 Unlocked Phones, 32GB+128GB/2TB Expand Cell Phone, 6.6''HD+90Hz Dispaly, 6250mah Battery, 4G Dual Sim Unlocked Smartphone, Widevine L1/NFC/OTG/Face Unlock",
    "stock": 15,
    "image_url": "https://m.media-amazon.com/images/I/71948vg6qZL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "SAMSUNG Galaxy A05 (128GB",
    "price": 116.5,
    "description": "The Samsung Galaxy A05 is a compelling entry in the economical segment of the Galaxy A series, offering a blend of functionality and performance. It features a 6.7-inch PLS LCD screen with HD+ resolution that delivers vibrant visuals. Powered by the MediaTek Helio G85 processor and available with up to 6 GB of RAM and 128 GB of expandable storage, the device handles daily tasks efficiently. Running Android 13 with Samsung’s One UI Core 5.1, the Galaxy A05 provides a smooth user interface. It sports a dual-camera setup, including a 50 MP main camera that captures high-quality images in good lighting, and a 2 MP depth sensor that enhances portrait photos. The 8 MP front camera offers respectable selfie capabilities in natural light. The phone's 5000 mAh battery supports 25W fast charging, ensuring prolonged usage and quick recharge times. It includes modern features like a USB Type-C port and retains a 3.5 mm headphone jack, catering to a variety of user preferences. Available in black, silver, and green, the Galaxy A05 combines essential features with reliable performance, making it a practical choice for budget-conscious consumers.",
    "stock": 53,
    "image_url": "https://m.media-amazon.com/images/I/61r6nWLIxYL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "Samsung Galaxy A14 5G A Series Cell Phone",
    "price": 96.47,
    "description": "A wide and vivid screen to explore: The 6.6-inch FHD+ display gives you plenty of space to fill with your favorite movies, games, and memories. Snap every side of your world: Go out and capture grand landscapes on Ultra-wide camera and a full spectrum of colors with the 50MP Main camera. Take true-to-life selfies with the 13MP Front camera, or even get intimate details on Macro camera. Power your every day with octa-core: Boost your day with powerful performance. Extend your memory with RAM Plus: Your Galaxy A14 smoothes things out when you're short-handed while multi-tasking, providing you just that extra room needed. Blow away your worries with long lasting battery: Your Galaxy A14 keeps your side from dawn to deep into the night for work and play. The 5,000mAh (typical)* battery gives you more time to do what you love.",
    "stock": 21,
    "image_url": "https://m.media-amazon.com/images/I/71vkaWmpemL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "TCL 60 XE NXTPAPER 5G Cell Phone",
    "price": 199.99,
    "description": "TCL 60 XE NXTPAPER 5G Cell Phone, AT&T, T-Mobile & Verizon Unlocked Android Smartphone, 8GB+128GB, 6.8\" 120Hz Paper-Like Display, AI Features, 5010mAh Battery, Advanced Camera System, Space Blue",
    "stock": 57,
    "image_url": "https://m.media-amazon.com/images/I/81IrxvqffWL._AC_SY300_SX300_QL70_FMwebp_.jpg"
  },
  {
    "name": "RENPHO Smart Scale for Body Weight",
    "price": 29.99,
    "description": "RENPHO Smart Scale for Body Weight, Digital Bathroom Scale BMI Weighing Bluetooth Body Fat Scale, Body Composition Monitor Health Analyzer with Smartphone App (White, 11\"/280mm)",
    "stock": 20,
    "image_url": "https://m.media-amazon.com/images/I/41-KiYQsRHL._SX342_SY445_QL70_FMwebp_.jpg"
  }

]